modules/catalyst/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0.orig/bottomWater/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomWater";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            zeroGradient;
        value           uniform 0;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 0;
    }
    minY
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    minZ
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    maxZ
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    bottomWater_to_rightSolid
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    bottomWater_to_leftSolid
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    bottomWater_to_heater
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}


// ************************************************************************* //
